In [28]:
import pandas as pd

df = pd.read_csv(r"C:\Users\zanyi\OneDrive\Git hub\Junior-Data-Scientist\DataSets-study_performance.csv")

df.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [29]:
maleCount = df['gender'].value_counts()
print(maleCount.male)
print(maleCount.female)

482
518

In [30]:
eduCount = df['parental_level_of_education'].value_counts()
eduCount

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental_level_of_education, dtype: int64

In [36]:
index = df[df["gender"]=="male"].index
femaledf = df.drop(index)
femaledf

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
...,...,...,...,...,...,...,...,...
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
995,female,group E,master's degree,standard,completed,88,99,95
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [53]:
femaleMath = sum(femaledf["math_score"].values.tolist())/len(femaledf["math_score"].values.tolist())
femaleEngReading = sum(femaledf["reading_score"].values.tolist())/len(femaledf["reading_score"].values.tolist())
femaleEngWriting = sum(femaledf["writing_score"].values.tolist())/len(femaledf["writing_score"].values.tolist())
print(femaleMath, femaleEngReading, femaleEngWriting)

63.633204633204635 72.60810810810811 72.46718146718146

In [43]:
index = df[df["gender"]!="male"].index
maledf = df.drop(index)
maledf

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
10,male,group C,associate's degree,standard,none,58,54,52
...,...,...,...,...,...,...,...,...
985,male,group A,high school,standard,none,57,51,54
987,male,group E,some high school,standard,completed,81,75,76
990,male,group E,high school,free/reduced,completed,86,81,75
994,male,group A,high school,standard,none,63,63,62
996,male,group C,high school,free/reduced,none,62,55,55

In [52]:
MaleMath = sum(maledf["math_score"].values.tolist())/len(maledf["math_score"].values.tolist())
MaleEnglishReading = sum(maledf["reading_score"].values.tolist())/len(maledf["reading_score"].values.tolist())
MaleEnglishWriting = sum(maledf["writing_score"].values.tolist())/len(maledf["writing_score"].values.tolist())
print(MaleMath, MaleEnglishReading, MaleEnglishWriting)

68.72821576763485 65.47302904564316 63.31120331950208